/*****************************************************************************
----------------------------------开发者信息---------------------------------
开 发 者：赵明

----------------------------------文件信息------------------------------------
文 件 名： App_cfg.h 
开发日期：2024-04-13 
文件功能：相应C文件的头文件，定义C文件对外公开的数据类型、接口函数及全局变量。

描    述：

-----------------------------------版本信息-----------------------------------
版    本：V1.0.0.0
版本说明：新创建

*******************************************************************************/

 #ifndef __PUBLIC_APP_CFG_H_
#define __PUBLIC_APP_CFG_H_

#if defined(__clang__)
#   pragma clang diagnostic push
#   pragma clang diagnostic ignored "-Winvalid-source-encoding"
#endif

#endif


 

